tsung_test/final-reports/server-side-caching-with-1000-users/test.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">
<clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="ec2-52-35-55-52.us-west-2.compute.amazonaws.com" port="80" type="tcp"/>
  </servers>


  <load>
  <arrivalphase phase="1" duration="30" unit="second">
    <users arrivalrate="1" unit="second"/>
  </arrivalphase>

  <arrivalphase phase="2" duration="30" unit="second">
    <users arrivalrate="2" unit="second"/>
  </arrivalphase>
    
  <arrivalphase phase="3" duration="30" unit="second">
    <users arrivalrate="4" unit="second"/>
  </arrivalphase>

  <arrivalphase phase="4" duration="30" unit="second">
    <users arrivalrate="8" unit="second"/>
  </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/users/sign_up" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <setdynvars sourcetype="random_number" start="1" end="999999">
        <var name="rand_user_num"/>
      </setdynvars>

      <request subst="true">
        <http url="/users" version="1.1" method="POST" contents="user%5Bemail%5D=%%_rand_user_num%%%40blah.com&amp;           user%5Busername%5D=%%_rand_user_num%%&amp;           user%5Bpassword%5D=12345678&amp;           user%5Bpassword_confirmation%5D=12345678&amp;           commit=Sign+me+up%21">
        </http>
      </request>
      
      <thinktime value="2" random="true"/>

      <request>
          <http url="/events/new" version="1.1" method="GET"/>
      </request>
      
      <thinktime value="2" random="true"/>
      
      <setdynvars sourcetype="random_string" length="20">
          <var name="event_title"/>
      </setdynvars>
      
      <setdynvars sourcetype="random_string" length="60">
          <var name="event_description"/>
      </setdynvars>
      
      <setdynvars sourcetype="random_number" start="1" end="12">
          <var name="event_month"/>
      </setdynvars>
      
      <setdynvars sourcetype="random_number" start="1" end="28">
          <var name="event_day"/>
      </setdynvars>
      
      <setdynvars sourcetype="random_number" start="0" end="23">
          <var name="event_hour"/>
      </setdynvars>
      
      <setdynvars sourcetype="random_number" start="0" end="29">
          <var name="start_minute"/>
      </setdynvars>
      
      <setdynvars sourcetype="random_number" start="30" end="59">
          <var name="end_minute"/>
      </setdynvars>
      
      <request subst="true">
          <http url="/events" version="1.1" method="POST" contents="event%5Btitle%5D=%%_event_title%%&amp;               event%5Bdescription%5D=%%_event_description%%&amp;               event%5Bstart_time%281i%29%5D=2015&amp;                event%5Bstart_time%282i%29%5D=%%_event_month%%&amp;                event%5Bstart_time%283i%29%5D=%%_event_day%%&amp;               event%5Bstart_time%284i%29%5D=%%_event_hour%%&amp;               event%5Bstart_time%285i%29%5D=%%_start_minute%%&amp;               event%5Bend_time%281i%29%5D=2015&amp;               event%5Bend_time%282i%29%5D=%%_event_month%%&amp;               event%5Bend_time%283i%29%5D=%%_event_day%%&amp;               event%5Bend_time%284i%29%5D=%%_event_hour%%&amp;               event%5Bend_time%285i%29%5D=%%_end_minute%%&amp;               commit=Create+Event">
          </http>
      </request>

      <thinktime value="2" random="true"/>

      <request>
          <http url="/groups/new" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <setdynvars sourcetype="random_string" length="20">
          <var name="group_title"/>
      </setdynvars>
      
      <setdynvars sourcetype="random_string" length="60">
          <var name="group_description"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="group_id" re="[Ll]ocation: http://.*/groups/(.*)\r"/>
          <http url="/groups" version="1.1" method="POST" contents="group%5Btitle%5D=%%_group_title%%&amp;               group%5Bdescription%5D=%%_group_description%%&amp;               group%5Bmembers%5D%5B%5D=&amp;               commit=Create+Group">
          </http>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/groups/%%_group_id%%" version="1.1" method="POST" contents="_method=delete">
        </http>
      </request> 

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/users/sign_out" version="1.1" method="POST" contents="_method=delete">
        </http>
      </request>

    </session>
  </sessions>
</tsung>